spine2.org
** Link-following & history

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-browse.el
(declare-function follow-reference-or-scholium "arxana-tangled" () t)
(declare-function display-an-article-that-current-article-is-about "arxana-tangled" () t)
(declare-function display-an-article-that-current-scholium-is-about "arxana-tangled" () t)
(declare-function sb-back "arxana-tangled" () t)
(declare-function sb-forward "arxana-tangled" () t)

;;;###autoload
(defun arxana-browse-follow-link ()
  "Follow the scholium or reference at point."
  (interactive)
  (arxana-browse--ensure 'follow-reference-or-scholium)
  (follow-reference-or-scholium))

;;;###autoload
(defun arxana-browse-follow-article-about ()
  "Jump to an article referenced by the current article."
  (interactive)
  (arxana-browse--ensure 'display-an-article-that-current-article-is-about)
  (display-an-article-that-current-article-is-about))

;;;###autoload
(defun arxana-browse-follow-scholium-about ()
  "Jump to an article referenced by the current scholium."
  (interactive)
  (arxana-browse--ensure 'display-an-article-that-current-scholium-is-about)
  (display-an-article-that-current-scholium-is-about))

;;;###autoload
(defun arxana-browse-history-back ()
  "Move to the previous article in the temporal browsing history."
  (interactive)
  (arxana-browse--ensure 'sb-back)
  (sb-back))

;;;###autoload
(defun arxana-browse-history-forward ()
  "Move to the next article in the temporal browsing history."
  (interactive)
  (arxana-browse--ensure 'sb-forward)
  (sb-forward))
#+END_SRC

** Relation buffers in context

- `M-x arxana-relations-show-ego` / `cooccur` / `tail` render Futon adjacency directly in Emacs buffers with refresh/provenance/copy bindings.
- The new literate blocks describe the buffer minor mode, formatting helpers, renderers, and commands.

** Relation buffers in context

The relation helpers render Futon adjacency inside Emacs so we no longer
need to shell out to curl. Each buffer is a minor mode with refresh,
provenance, and copy-id bindings.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-relations.el
;;; arxana-relations.el --- Relation browsing helpers -*- lexical-binding: t; -*-

;;; Commentary:
;; Interactive commands that render Futon relation data (/ego, /cooccur, /tail)
;; inside Emacs so users no longer need to shell out to curl.

;;; Code:

(require 'cl-lib)
(require 'seq)
(require 'subr-x)
(require 'arxana-store)

(declare-function futon4-lookup-article-id "arxana-tangled" (name))
(declare-function futon4--article-id-for "arxana-tangled" (name &optional path))

(defgroup arxana-relations nil
  "Buffers for browsing Futon relation data."
  :group 'arxana)

(defconst arxana-relations-buffer-name "*Arxana Relations*")

(defvar-local arxana-relations-context nil
  "Plist describing the last Futon render in this buffer.")

(defvar arxana-relations-buffer-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "g") #'arxana-relations-refresh)
    (define-key map (kbd "p") #'arxana-relations-provenance)
    (define-key map (kbd "y") #'arxana-relations-copy-id)
    map)
  "Keymap for `arxana-relations-buffer-mode'.")

(define-minor-mode arxana-relations-buffer-mode
  "Minor mode that adds refresh/provenance commands to relation buffers."
  :lighter " ArxRel"
  :keymap arxana-relations-buffer-mode-map
  (if arxana-relations-buffer-mode
      (setq-local revert-buffer-function #'arxana-relations--revert-buffer)
    (kill-local-variable 'revert-buffer-function)))
#+END_SRC

** Formatting helpers

Before we render anything we normalize type labels, build friendly names,
and provide helpers for inserting sections into the buffer.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-relations.el
(defun arxana-relations--type-label (type)
  (cond
   ((keywordp type) (substring (symbol-name type) 1))
   ((symbolp type) (symbol-name type))
   ((stringp type) type)
   (t (format "%s" type))))

(defun arxana-relations--name-with-type (name type)
  (if (and name type)
      (format "%s (%s)" name (arxana-relations--type-label type))
    (or name "?")))

(defun arxana-relations--entity-name (entity)
  (or (alist-get :entity/name entity)
      (alist-get :name entity)))

(defun arxana-relations--entity-type (entity)
  (or (alist-get :entity/type entity)
      (alist-get :type entity)))

(defun arxana-relations--insert-line (fmt &rest args)
  (insert (apply #'format (concat fmt "\n") args)))

(defun arxana-relations--insert-section (title lines)
  (arxana-relations--insert-line "%s" title)
  (if (seq-empty-p lines)
      (arxana-relations--insert-line "  (none)")
    (dolist (line lines)
      (arxana-relations--insert-line "  - %s" line))))
#+END_SRC

** Rendering Futon responses

Each renderer translates a Futon response (`/ego`, `/cooccur`, `/tail`) into a
human-readable set of lines.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-relations.el
(defun arxana-relations--render-ego (body)
  ;; ... body of function ...
  )

(defun arxana-relations--render-cooccur (body)
  ;; ... body of function ...
  )

(defun arxana-relations--render-tail (body)
  ;; ... body of function ...
  )

(defun arxana-relations--render-fallback (body)
  (arxana-relations--insert-line "Raw response:")
  (pp body (current-buffer)))
#+END_SRC

** Commands & context

Finally we wire up interactive commands (`arxana-relations-show-ego`, etc.),
store the last Futon context, and expose refresh/provenance/copy-id helpers.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-relations.el
;; ... remaining functions from dev/arxana-relations.el ...

(provide 'arxana-relations)

;;; arxana-relations.el ends here
#+END_SRC

** Legacy navigation commands

#+INCLUDE: "dev/arxana-browse.el" src emacs-lisp

** XTDB browsing shims

The XTDB browser exposes `/tail` data via a tabulated list and lets contributors
inspect source/target entities, jump into relation buffers, or tweak the limit.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-xtdb-browse.el
;;; arxana-xtdb-browse.el --- XTDB browser for Futon datasets -*- lexical-binding: t; -*-

;;; Commentary:
;; Provides an Emacs UI for peeking into Futon/XTDB data.  Uses `/tail`
;; to list recent relations and lets users drill into entities or
;; open the existing relation buffers.

;;; Code:

(require 'seq)
(require 'tabulated-list)
(require 'subr-x)
(require 'arxana-store)
(require 'arxana-relations)

(defgroup arxana-xtdb-browse nil
  "Interactive browser for Futon/XTDB contents."
  :group 'arxana)

(defcustom arxana-xtdb-browse-default-limit 25
  "Number of relations to request when browsing XTDB."
  :type 'integer
  :group 'arxana-xtdb-browse)

(defvar arxana-xtdb-browse-buffer "*Arxana XTDB Browser*")
(defvar-local arxana-xtdb--current-limit arxana-xtdb-browse-default-limit)
(defvar-local arxana-xtdb--tail-response nil)
#+END_SRC

