dev/arxana-xtdb-browse.el
;;; arxana-xtdb-browse.el --- XTDB browser for Futon datasets -*- lexical-binding: t; -*-

;;; Commentary:
;; Provides an Emacs UI for peeking into Futon/XTDB data.  Uses `/tail`
;; to list recent relations and lets users drill into entities or
;; open the existing relation buffers.

;;; Code:

(require 'seq)
(require 'tabulated-list)
(require 'subr-x)
(require 'arxana-store)
(require 'arxana-relations)

(defgroup arxana-xtdb-browse nil
  "Interactive browser for Futon/XTDB contents."
  :group 'arxana)

(defcustom arxana-xtdb-browse-default-limit 25
  "Number of relations to request when browsing XTDB."
  :type 'integer
  :group 'arxana-xtdb-browse)

(defvar arxana-xtdb-browse-buffer "*Arxana XTDB Browser*")
(defvar-local arxana-xtdb--current-limit arxana-xtdb-browse-default-limit)
(defvar-local arxana-xtdb--tail-response nil)

(defun arxana-xtdb--entity-name (entity)
