spine2.org
** XTDB helpers

Normalize Futon rows into tabulated entries and provide entity inspectors.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-xtdb-browse.el
(defun arxana-xtdb--entity-name (entity)
  (or (alist-get :name entity)
      (alist-get :entity/name entity)
      "<unknown>"))

(defun arxana-xtdb--entity-type (entity)
  (or (alist-get :type entity)
      (alist-get :entity/type entity)))

(defun arxana-xtdb--entity-ident (entity)
  (or (alist-get :ident entity)
      (alist-get :entity/id entity)))

(defun arxana-xtdb--entity-label (entity)
  (let ((name (arxana-xtdb--entity-name entity))
        (type (arxana-xtdb--entity-type entity)))
    (if type
        (format "%s (%s)" name type)
      name)))

(defun arxana-xtdb--relation-row-p (row)
  (and (listp row)
       (consp (car row))
       (or (alist-get :src row)
           (alist-get :dst row))))

(defun arxana-xtdb--tail-rows (body)
  "Normalize BODY (from `/tail`) into a list of relation alists."
  (let* ((section (or (alist-get :tail body)
                      body))
         (raw (or (alist-get :relations section)
                  (alist-get :links section)
                  (alist-get :items section)
                  section)))
    (when (not (listp raw))
      (setq raw nil))
    (seq-filter #'arxana-xtdb--relation-row-p raw)))

(defun arxana-xtdb--rows->entries (rows)
  "Return tabulated-list entries derived from ROWS."
  (let ((index 0))
    (mapcar
     (lambda (row)
       (setq index (1+ index))
       (let* ((src (alist-get :src row))
              (dst (alist-get :dst row))
              (relation (alist-get :type row))
              (last-seen (or (alist-get :last-seen row)
                             (alist-get :hx/last-seen row)
                             ""))
              (vector (vector (format "%s" last-seen)
                              (format "%s" relation)
                              (arxana-xtdb--entity-label src)
                              (arxana-xtdb--entity-label dst))))
         (list index vector row)))
     rows)))

(defun arxana-xtdb--describe-entity (entity)
  "Display ENTITY data using `arxana-store-fetch-entity'."
  (let* ((ident (arxana-xtdb--entity-ident entity))
         (name (arxana-xtdb--entity-name entity)))
    (unless ident
      (user-error "No Futon id recorded for %s" name))
    (let ((data (arxana-store-fetch-entity ident)))
      (unless data
        (user-error "No Futon data for %s" name))
      (with-current-buffer (get-buffer-create "*Arxana Entity*")
        (let ((inhibit-read-only t))
          (erase-buffer)
          (insert (format "Entity: %s\nId: %s\n\n" name ident))
          (pp data (current-buffer))
          (goto-char (point-min))
          (view-mode 1))
        (display-buffer (current-buffer))))))
#+END_SRC

** Tabulated UI & commands

The major mode uses `tabulated-list-mode` with shortcuts for refreshing,
changing limits, inspecting raw payloads, and opening relation buffers.

#+BEGIN_SRC emacs-lisp :tangle dev/arxana-xtdb-browse.el
(defun arxana-xtdb-refresh (&optional limit)
  "Refresh the XTDB browser contents with LIMIT rows."
  (interactive)
  (let* ((limit (or limit arxana-xtdb--current-limit))
         (body (arxana-store-tail limit)))
    (setq arxana-xtdb--current-limit limit
          arxana-xtdb--tail-response body)
    (let ((rows (arxana-xtdb--tail-rows (or body '()))))
      (if rows
          (progn
            (setq tabulated-list-entries (arxana-xtdb--rows->entries rows))
            (tabulated-list-print t)
            (message "Fetched %d relations" (length rows)))
        (setq tabulated-list-entries nil)
        (tabulated-list-print t)
        (message "No relations returned from Futon")))))

(defun arxana-xtdb-browse-change-limit (limit)
  "Set a new LIMIT for `/tail` results and refresh."
  (interactive (list (read-number "Tail limit: " arxana-xtdb--current-limit)))
  (arxana-xtdb-refresh limit))

(defun arxana-xtdb-browse-inspect-raw ()
  "Display the raw `/tail` payload for debugging."
  (interactive)
  (unless arxana-xtdb--tail-response
    (user-error "No XTDB payload captured yet"))
  (with-current-buffer (get-buffer-create "*Arxana XTDB Raw*")
    (let ((inhibit-read-only t))
      (erase-buffer)
      (pp arxana-xtdb--tail-response (current-buffer))
      (goto-char (point-min))
      (view-mode 1))
    (display-buffer (current-buffer))))

(defvar arxana-xtdb-browse-mode-map
  (let ((map (copy-keymap tabulated-list-mode-map)))
    (define-key map (kbd "g") #'arxana-xtdb-refresh)
    (define-key map (kbd "l") #'arxana-xtdb-browse-change-limit)
    (define-key map (kbd "RET") #'arxana-xtdb-browse-show-ego)
    (define-key map (kbd "s") #'arxana-xtdb-browse-open-source)
    (define-key map (kbd "t") #'arxana-xtdb-browse-open-target)
    (define-key map (kbd "R") #'arxana-xtdb-browse-inspect-raw)
    map)
  "Keymap for `arxana-xtdb-browse-mode'.")

(define-derived-mode arxana-xtdb-browse-mode tabulated-list-mode "XTDB"
  "Major mode for browsing Futon/XTDB relations."
  (setq tabulated-list-format [("Seen" 18 t)
                               ("Relation" 18 t)
                               ("Source" 25 t)
                               ("Target" 25 t)]
        tabulated-list-padding 2
        tabulated-list-sort-key (cons "Seen" nil))
  (tabulated-list-init-header))

;;;###autoload
(defun arxana-xtdb-browse (&optional limit)
  "List recent Futon relations using a tabulated UI.
When LIMIT is provided (or via prefix), request that many rows."
  (interactive (list (when current-prefix-arg
                       (read-number "Tail limit: " arxana-xtdb-browse-default-limit))))
  (let ((buffer (get-buffer-create arxana-xtdb-browse-buffer)))
    (with-current-buffer buffer
      (arxana-xtdb-browse-mode)
      (arxana-xtdb-refresh limit))
    (pop-to-buffer buffer)))

(provide 'arxana-xtdb-browse)

;;; arxana-xtdb-browse.el ends here
#+END_SRC

* Org imports / exports & snapshots

- `M-x arxana-import-org-file` derives an article name from `#+TITLE` (or the filename), stores the text as a scholium, and mirrors it into XTDB.
- `M-x arxana-import-org-directory` walks a tree of `.org` files (`C-u` to recurse) and feeds each file through the importer.
- `M-x arxana-export-org-directory` writes every loaded article back to disk and produces a manifest with snapshot metadata, inclusion/transclusion summaries, and a label index. With sync enabled the command first captures a Futon snapshot so the export is tied to a specific XTDB revision.
- `C-; r` / `M-x save-all-scholia` hit `/snapshot` when sync is enabled (falling back to the `.sch` writer when offline). `M-x read-scholia-file` mirrors the behavior for restore.
- Migration recipe: 1) snapshot the legacy collection, 2) run `arxana-import-org-directory`, 3) edit in Emacs, 4) export and capture the new manifest for diffable releases.

